[
  {
    "mood": "Joyful",
    "affirm": [
      "Your joy is a powerful testimony! It’s a radiant reflection of God’s incredible love for you. — Psalm 118:24. Keep shining your light today!",
      "Let that smile bloom! God is orchestrating a magnificent plan for your life, full of purpose and hope. — Jeremiah 29:11. You are deeply loved and divinely chosen!",
      "Rejoice in this moment! Find your constant joy in the Lord, for His faithfulness never ends. — 1 Thessalonians 5:16. Let your happiness be contagious and inspire others!",
      "Tap into your supernatural strength today! Let the profound joy you find in the Lord be your unshakable foundation. — Nehemiah 8:10. You are stronger than you know!",
      "Turn up the music in your soul! Sing and make a joyful noise, for the Lord is always by your side. — Psalm 100:1. Embrace today with a happy and open heart!",
      "Laugh without fear of the future! A cheerful heart is like the best medicine, healing and uplifting your spirit. — Proverbs 17:22. Share that healing joy today!",
      "Dance in the light of His goodness! The Lord has done marvelous things for us, and that alone is reason to be filled with joy. — Psalm 126:3. Celebrate His wonderful works!"
    ]
  },
  {
    "mood": "Grateful",
    "affirm": [
      "Shift your perspective! Gratitude is the key that unlocks a deeper awareness of God’s endless blessings. — 1 Thessalonians 5:18. Take time to appreciate the little miracles today!",
      "Unlock a heart of contentment! A thankful attitude paves the way for God's perfect peace to guard your heart. — Colossians 3:15. Stay positive, stay content!",
      "Make thankfulness your default setting! Give thanks in every single situation, for this is God’s beautiful will for you. — 1 Thessalonians 5:18. Remember, every day is a precious gift!",
      "Turn your day into a praise party! Bless the Lord at all times; let His praise be constantly on your lips. — Psalm 34:1. Let your heart overflow with gratitude!",
      "Open your eyes to the wonders around you! A heart trained in gratitude sees God’s gentle goodness in every detail of daily life. — Psalm 107:1. Recognize the blessings hiding in plain sight!",
      "Start your day on the right foot! Enter into His presence with a thankful heart and a song of praise. — Psalm 100:4. Set the tone for a blessed day!",
      "Trace the gifts back to the Giver! Every good and perfect present in your life is a generous gift from your Father above. — James 1:17. Acknowledge His generosity today!"
    ]
  },
  {
    "mood": "Tired",
    "affirm": [
      "Your strength is not gone; it’s being renewed. Wait upon the Lord, and He will recharge your spirit and body. — Isaiah 40:31. Rest and trust in Him today!",
      "You have a standing invitation to rest. Come to Him, all who feel weighed down, and He will give your soul a place to truly relax. — Matthew 11:28. Take a sacred moment to just breathe deeply!",
      "You are not alone in your exhaustion. He personally invites you to come, and He promises to give you rest for your weary soul. — Matthew 11:28. You are seen and cared for!",
      "Your weakness is an opportunity for His power. He generously gives strength to the faint and increases the power of the weak. — Isaiah 40:29. Keep moving forward gently, leaning on Him!",
      "You don't have to carry that load. Roll your anxieties, your worries, and your burdens onto the Lord—He can handle them. — Psalm 55:22. Let go and feel His supportive presence!",
      "It’s okay to pause. God Himself rested after His work, modeling for us the sacred rhythm of work and rest. — Genesis 2:2. Give yourself permission to truly recharge.",
      "This season of weariness is not your forever. He offers rest for your soul, a deep and lasting peace that restores you from the inside out. — Matthew 11:29. Receive His gift of rest."
    ]
  },
  {
    "mood": "Anxious",
    "affirm": [
      "You can release the grip of worry. Cast the entire cargo of your anxieties onto Him, because He cares for you deeply and personally. — 1 Peter 5:7. Trust that He is firmly in control!",
      "Receive a peace that doesn't make sense. My peace is my personal gift to you; don’t let your heart be troubled or afraid. — John 14:27. Let your heart find its rest in His perfect peace!",
      "Interrupt anxiety with prayer. Don’t be anxious about anything; instead, turn every worry into a conversation with God. — Philippians 4:6. Just take one step, one prayer, at a time!",
      "Navigate life with a divine GPS. Trust in the Lord with your whole heart; don’t rely on your own understanding. — Proverbs 3:5. Lean with your full weight on His guidance!",
      "You are in a stronghold of safety. God is our ultimate refuge and our source of strength, a very present help in times of trouble. — Psalm 46:1. Find your safety in His presence!",
      "Trade your fear for faith. I am with you always, so do not be dismayed, for I am your God who will strengthen you. — Isaiah 41:10. You are held and empowered.",
      "Your thoughts are safe with Him. His incomprehensible peace will stand guard over your heart and mind like a soldier. — Philippians 4:7. Let His peace patrol your thoughts today."
    ]
  },
  {
    "mood": "Hopeful",
    "affirm": [
      "Your hope is a confident expectation! This hope will not lead to disappointment because God’s love has been poured into your heart. — Romans 5:5. Keep looking forward with bold faith!",
      "Your future is bright and purposeful. I know the plans I have for you, plans to prosper you and to give you a future filled with hope. — Jeremiah 29:11. Brighter days are on the horizon!",
      "Your hope has an unbreakable anchor. We have this hope as an anchor for the soul, firm and secure in Christ. — Hebrews 6:19. He will never, ever let you down!",
      "Let hope fuel your perseverance. Be joyful in hope, patient in times of difficulty, and faithful in prayer. — Romans 12:12. Your steadfastness will be rewarded!",
      "Trust the divine timeline. God has a beautiful future filled with hope waiting for you. — Jeremiah 29:11. Trust His perfect timing—it's worth the wait!",
      "Hope is your helmet of salvation. Protect your mind with the confident hope of your salvation. — 1 Thessalonians 5:8. You are safe and secure in Him.",
      "Hope is a light in the darkness. The God of hope fill you with all joy and peace as you trust in him, so that you may overflow with hope. — Romans 15:13. Be filled to overflowing today!"
    ]
  },
  {
    "mood": "Calm",
    "affirm": [
      "Hit the pause button on life. Be still, cease striving, and know with certainty that I am God. — Psalm 46:10. Let His majestic presence soothe your busy mind!",
      "Experience peace that surpasses logic. God’s own presence brings a serenity that guards your heart and mind in Christ Jesus. — Philippians 4:7. Embrace this divine peace today!",
      "Receive a double portion of peace. The Lord Himself will give you His perfect strength and His unexplainable peace. — Isaiah 26:3. Relax into His capable guidance!",
      "Find your power in tranquility. In returning to quietness and resting in trust shall be your true strength. — Isaiah 30:15. Take a deep, holy breath and find your rest in Him!",
      "My peace is my parting gift to you. My own peace I give to you; not as the world gives, do I give to you. — John 14:27. Let this divine calmness flow through you!",
      "Dwell in a place of peace. You will keep in perfect peace those whose minds are steadfast, because they trust in you. — Isaiah 26:3. Steady your thoughts on Him.",
      "Let peace be the umpire in your heart. Let the peace of Christ rule in your hearts, since as members of one body you were called to peace. — Colossians 3:15. Let His peace make the calls today."
    ]
  }
]